# from urllib.parse import urlparse
# url = "https://aviation-safety.net/database/dblist.php?Year=2019"
# import spynner
# url=requests.get(url)
# print(url.json())
dct = {'LDG': 20, 'TOF': 4, 'ENR': 11, 'APR': 2, 'MNV': 1, 'TXI': 3, 'STD': 4, 'ICL': 2}
phases_lst = sorted(list(dct.items()), key=lambda x: x[1], reverse=True)

print(phases_lst)

"""

4.2
Розробити набір модульних тестів для перевірки працездатності
розробленої реалізації абстрактного типу даних
Два окремих Python
модулі

4.5 Описати програму, яка розроблена для виконання завдання
дослідження. Опис повинен містити такі основні пункти:
- Призначення та коротка характеристика програми
- Вхідні та вихідні дані програми
- Структура програми з коротким описом модулів, функцій,
класів та методів.
- Коротка інструкція по користуванню програмою
- Опис тестових прикладів для первірки працездатності
програми.
Текстовий документ
файл README.md

"""